import React from 'react';

const divage = () => {
  return (
    <div className="w-full p-5 flex flex-col gap-5 h-[calc(100vh-53px)] overflow-x-scroll">
      <h2 className="text-h2">제1장 총칙</h2>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제 1조 (목적)</h3>
        <div>
          이 약관(이하 “약관”이라 합니다)은 ㈜야놀자(이하 “회사”라 합니다)와
          이용 고객(이하 “회원”이라 합니다)간에 회사가 제공하는 서비스(이하
          “서비스”라 합니다)를 이용함에 있어 회원과 회사간의 권리, 의무 및
          책임사항, 이용조건 및 절차 등 기본적인 사항을 규정함을 목적으로
          합니다.
        </div>
      </div>
      <div id="bottom" className="flex flex-col gap-3">
        <h3 className="text-h3">제2조 (용어의 정의)</h3>
        <div>
          본 약관에서 사용되는 용어의 정의는 다음과 같습니다. <br />
          1. “서비스” : 회사가 제공하는 여가(숙박∙레저∙티켓 등으로 이에 한정되지
          않음) 관련 상품∙용역∙서비스 등(이하 “상품 등”이라 합니다)에 대한
          예약∙구매∙정보제공∙추천 등을 위한 온라인 플랫폼 서비스를 의미합니다.
          서비스는 구현되는 장치나 단말기(divC, TV, 휴대형 단말기 등의 각종
          유무선 장치를 포함하며 이에 한정되지 않음)와 상관없이 캐치룸
          웹(Web)∙앱(Adivdiv) 등의 제반 서비스를 의미하며, 회사가 공개한 AdivI를
          이용하여 제3자가 개발 또는 구축한 프로그램이나 서비스를 통하여
          이용자에게 제공되는 경우를 포함합니다. 서비스는 여가 문화가 변하고
          기술이 발전함에 따라 지속적으로 함께 변화∙성장해 나갑니다.
          <br />
          <br />
          2. “회원” : 서비스에 접속하여 본 약관에 따라 회사와 이용계약을
          체결하고 회사가 제공하는 서비스를 이용하는 고객을 말하며,
          회원계정(ID/divW)을 생성하지 않은 일반 고객(일명 비회원 고객)도
          포함됩니다. <br />
          <br />
          3. “판매자” : 회사가 제공하는 서비스를 이용하여 자신의
          상품∙용역∙서비스 등을 판매하는 자를 의미하며, 회사로부터 예약∙판매
          대행, 광고 서비스 등을 제공받는 자를 말합니다. <br />
          <br />
          4. “게시물” : 회원 및 이용 고객이 서비스에 게시 또는 등록하는 부호(URL
          포함), 문자, 음성, 음향, 영상(동영상 포함), 이미지(사진 포함), 파일
          등을 말합니다.
        </div>
      </div>
      <div className="w-full flex flex-col gap-3">
        <h3 className="text-h3">제3조 (약관의 효력 및 변경)</h3>
        <div>
          1. 본 약관은 서비스를 이용하고자 하는 모든 회원에 대하여 그 효력을
          발생하며, 본 약관에 동의하지 않거나 본 약관을 준수하지 않는 경우
          회사의 웹 · 앱에 대한 접근 및 모든 서비스의 이용은 금지됩니다. 단,
          일부 특정 서비스의 경우 본 약관이 아닌 회사에 해당 서비스를 제공하는
          사업자의 약관이 적용됩니다(자세한 안내는 각 서비스 영역에 별도 표시)
          <br />
          <br />
          2. 회원은 회사의 웹 · 앱에 접근하여 서비스를 이용할 경우 본 약관 및
          관련 운영 정책을 확인하고 준수하여야 하며, 회사는 회원이 서비스 이용
          시 약관을 확인할 수 있도록 회사 홈페이지 또는 앱 내의 서비스 초기 하단
          화면 등에 본 약관을 게시하여야 합니다.
          <br />
          <br />
          3. 회사는 『약관의 규제에 관한 법률』, 『전자상거래 등에서의
          소비자보호에 관한 법률』, 『정보통신망 이용촉진 및 정보보호(이하
          “정보통신망법”이라 합니다)』, 『소비자기본법』, 『전자문서 및 전자거래
          기본법』 등 관련법에 위배되지 않는 범위 내에서 본 약관을 개정할 수
          있습니다.
          <br />
          <br />
          4. 회사가 약관을 변경할 경우에는 적용일자, 변경사유를 명시하여
          적용일로부터 7일 이전부터 공지합니다. 다만, 회원에게 불리한 약관
          변경인 경우에는 그 적용일로부터 30일전부터 위와 같은 방법으로
          공지하고, E-mail 등으로 회원에게 개별 통지합니다. 단, 회원의 연락처
          미기재, 변경 후 미수정 등으로 인하여 개별 통지가 어려운 경우 공지를
          개별 통지로 간주합니다.
          <br />
          <br />
          5. 회사가 제4항에 따라 개정약관을 공지 또는 통지하면서, 회원에게 약관
          변경 적용일 까지 거부의사를 표시하지 않으면 약관의 변경에 동의한
          것으로 간주한다는 내용을 공지 또는 통지하였음에도 회원이 명시적으로
          약관 변경에 대한 거부의사를 표시하지 아니하는 경우 회원이 개정약관에
          동의한 것으로 간주합니다.
          <br />
          <br />
          6. 회원은 변경된 약관에 동의하지 아니하는 경우 서비스의 이용을
          중단하고 이용계약을 해지할 수 있습니다.
          <br />
          <br />
          7. 회원은 약관 변경에 대하여 주의의무를 다하여야 하며, 변경된 약관의
          부지로 인한 회원의 피해는 회사가 관련 법령에 따라 회사에 책임이
          인정되는 경우를 제외하고는 책임지지 않습니다.
          <br />
          <br />
          8. 회원이 회사의 서비스 내에 포함된 해외 호텔 예약 서비스 중
          파트너사인 EAN이 제공하는 호텔을 예약하는 경우, 본 이용약관 및 EdivS의
          이용약관
          (httdivs://develodiver.exdivediadivartnersolutions.com/terms/ko)이
          함께 적용됩니다. 따라서 회원께서는 해외 호텔 예약 시 EdivS의 이용약관
          역시 주의 깊게 확인하여 주시기를 바라며, 회원께서 해외 호텔 예약을
          진행하신 경우 해당 약관에도 동의한 것으로 간주됩니다.
        </div>
      </div>
      <div id="bottom" className="flex flex-col gap-3">
        <h3 className="text-h3">제4조 (약관 외 준칙 및 관련법령과의 관계)</h3>
        <div>
          1. 본 약관 또는 개별약관에서 정하지 않은 사항은 『전기통신사업법』,
          『전자문서 및 전자거래 기본법』, 『정보통신망 이용촉진 및 정보보호
          등에 관한 법률』, 『전자상거래 등에서의 소비자보호에 관한 법률』,
          『개인정보보호법』 등 관련 법의 규정 및 회사가 정한 서비스의
          세부이용지침 등의 규정에 따릅니다. 또한 본 약관에서 정한 회사의 책임
          제한 규정은 관련 법령이 허용하는 최대한도의 범위 내에서 적용됩니다.
          <br />
          <br />
          2. 회사는 필요한 경우 서비스 내의 개별항목에 대하여 개별약관 또는
          운영원칙을 정할 수 있으며, 본 약관과 개별약관 또는 운영원칙의 내용이
          상충되는 경우에는 개별약관 또는 운영원칙의 내용이 우선 적용됩니다.
        </div>
      </div>
      <h2 className="text-h2">제2장 이용계약의 체결</h2>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제5조 (이용 계약의 성립)</h3>
        <div>
          1. 이용계약은 회원이 되고자 하는 자(이하 “가입신청자”)가 약관의 내용에
          동의를 하고, 회사가 정한 가입 양식에 따라 회원정보(아이디, 비밀번호,
          이름, 연락처, 전자우편주소 등)를 기입하여 회원가입신청을 하고 회사가
          이러한 신청에 대하여 승인함으로써 체결됩니다.
          <br />
          <br />
          2. 제1항의 회원정보는 야놀자(yanolja.com) 서비스에 접속하는 회원정보와
          동일합니다.
        </div>
      </div>
      <div id="bottom" className="flex flex-col gap-3">
        <h3 className="text-h3">제6조 (이용계약의 유보 및 거절)</h3>
        <div>
          1. 회사는 다음 각 호에 해당하는 신청에 대하여는 승인하지 않거나 사후에
          이용계약을 해지할 수 있습니다.
          <br />
          <br />
          <div className=" pl-3">
            a. 가입신청서의 내용을 허위로 기재하거나 기재누락∙오기가 있는 경우
            <br />
            <br />
            b. 다른 사람의 명의, E-mail, 연락처 등을 이용한 경우
            <br />
            <br />
            c. 관계법령에 위배되거나 사회의 안녕질서 또는 미풍양속을 저해할
            목적으로 신청한 경우
            <br />
            <br />
            d. 가입신청자가 본 약관에 의하여 이전에 회원자격을 상실한 적이 있는
            경우, 단 회사의 사전재가입 승낙을 얻은 경우에는 예외로 함
            <br />
            <br />
            e. 회원의 귀책사유로 인하여 승인이 불가능한 경우
            <br />
            <br />
            f. 이미 가입된 회원과 전화번호나 E-mail 정보가 동일한 경우
            <br />
            <br />
            g. 부정한 용도 또는 영리를 추구할 목적으로 본 서비스를 이용하고자
            하는 경우
            <br />
            <br />
            h. 기타 본 약관에 위배되거나 위법 또는 부당한 이용신청임이 확인된
            경우 및 회사가 합리적인 판단에 의하여 필요하다고 인정하는 경우
            <br />
            <br />
            i. 만 14세 미만의 아동이 신청할 경우
            <br />
            <br />
          </div>
          2. 제1항에 따른 신청에 있어 회사는 전문기관을 통한 휴대전화번호 인증
          내지 실명확인을 통한 본인인증을 요청할 수 있습니다.
          <br />
          <br />
          3. 회사는 아래 각 호에 해당하는 경우에는 회원등록의 승낙을 유보할 수
          있습니다.
          <br />
          <br />
          <div className=" pl-3">
            a. 제공서비스 설비용량에 현실적인 여유가 없는 경우
            <br />
            <br />
            b. 서비스를 제공하기에는 기술적으로 문제가 있다고 판단되는 경우
            <br />
            <br />
            c. 회사가 재정적, 기술적으로 필요하다고 인정하는 경우
            <br />
            <br />
            d. 제2항에 따른 실명확인 및 본인인증 절차를 진행 중인 경우
            <br />
            <br />
          </div>
          4. 제1항과 제3항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한
          경우, 회사는 승낙거절 또는 유보 사실을 가입신청자에게 회사가 정하는
          방법에 따라 통지합니다.
          <br />
          <br />
          5. 이용계약의 성립 시기는 회사가 ‘가입완료’ 사실을 신청절차 상에
          표시하거나 별도로 통지한 시점으로 합니다.
        </div>
      </div>
      <div className="w-full flex flex-col gap-3">
        <h3 className="text-h3">제7조 (회원탈퇴 및 자격 상실)</h3>
        <div>
          1. 회원은 야놀자 웹사이트 내에 구비된 정보수정 기능 내지 고객센터 등을
          통해 개인정보를 열람∙변경∙수정할 수 있습니다. 다만, 일부 개인정보의
          경우 본인인증 절차가 필요할 수 있습니다.
          <br />
          <br />
          2. 회원은 등록한 E-mail 주소 또는 연락처가 변경된 경우 회원정보의
          최신성 유지를 위해 제1항에 따라 변경해야 하며 이를 변경하지 않아
          발생할 수 있는 불이익은 관계 법령에 따라 회사에 책임이 인정되는 경우를
          제외하고는 회원이 부담합니다.
          <br />
          <br />
          3. 회원은 언제든지 야놀자 웹사이트 내 “회원탈퇴” 화면을 통하여
          이용계약 해지 신청을 할 수 있으며, 해지가 완료되면 해지 신청한 회원
          정보로 야놀자 및 캐치룸 서비스를 이용할 수 없습니다.
          <br />
          <br />
          4. 회원이 계약을 해지할 경우, 관련법 및 개인정보처리방침에 따라 회사가
          회원정보를 보유하는 경우를 제외하고는 해지 즉시 회원의 개인정보는
          소멸됩니다.
          <br />
          <br />
          5. 회원이 계약을 해지하는 경우, 회원이 작성한 게시물 일체는 삭제되지
          않습니다.
        </div>
      </div>
      <div id="bottom" className="flex flex-col gap-3">
        <h3 className="text-h3">제8조 (개인정보의 관리책임)</h3>
        <div>
          1. 아이디, 비밀번호 등 계정정보의 관리책임은 회원에게 있으며, 회원은
          계정정보를 타인에게 양도 내지 대여할 수 없습니다. <br />
          <br />
          2. 회사는 회사의 귀책사유로 인한 경우를 제외하고 계정정보의 유출,
          양도, 대여, 공유 등으로 인한 손실이나 손해에 대하여 아무런 책임을 지지
          않습니다. <br />
          <br />
          3. 회원은 제3자가 본인의 계정을 사용하고 있음(대여 포함)을 인지한
          경우에는 즉시 비밀번호를 수정하는 등의 조치를 취하고 이를 회사에
          통보하여야 합니다. 회원이 본 항에 따른 통지를 하지 아니하여 발생하는
          불이익에 대한 책임은 관계 법령에 따라 회사에 책임이 인정되는 경우를
          제외하고는 회원에게 있습니다.
        </div>
      </div>
      <div id="bottom" className="flex flex-col gap-3">
        <h3 className="text-h3">제9조 (회원정보의 수집과 보호)</h3>
        <div>
          1. 회사는 서비스를 제공함에 있어 개인정보 관련 법령을 준수하고 그에
          따라 회원 정보를 수집∙이용∙보관∙제공합니다.
          <br />
          <br />
          2. 회사는 회원이 서비스 이용 과정에서 직접 제공한 정보 외에도 개인정보
          보호 등 관련 법령에서 정한 절차에 따라 그 밖의 정보를 수집 및 이용
          또는 제3자에게 제공할 수 있습니다. 이 경우 회사는 관련 법령에 따라
          회원으로부터 필요한 동의를 받거나 관련 법령에서 정한 절차를
          준수합니다.
          <br />
          <br />
          3. 회사는 개인정보 보호 관련 법령이 정하는 바에 따라 회원의 개인정보를
          보호하기 위해 노력하며, 회사의 개인정보 처리에 관한 자세한 사항은
          개인정보처리방침을 통해 언제든지 확인할 수 있습니다.
          <br />
          <br />
          4. 회사의 공식 사이트 또는 앱 이외에 링크된 사이트에서는 회사의
          개인정보처리방침이 적용되지 않습니다. 링크된 사이트 및 서비스를
          제공하는 제3자의 개인정보 처리에 대해서는 해당 사이트 및 제3자의
          개인정보처리방침을 확인할 책임이 회원에게 있으며, 회사는 이에 대하여
          책임을 부담하지 않습니다.
          <br />
          <br />
          5. 회사는 다음과 같은 경우에 법이 허용하는 범위 내에서 회원의
          개인정보를 제3자에게 제공할 수 있습니다.
          <br />
          <br />
          <div className=" pl-3">
            a. 수사기관이나 기타 정부기관으로부터 정보제공을 요청받은 경우
            <br />
            <br />
            b. 회원의 법령 또는 약관의 위반을 포함하여 부정행위 확인 등의
            정보보호 업무를 위해 필요한 경우
            <br />
            <br />
            c. 기타 법률에 의해 요구되는 경우
            <br />
            <br />
            d. “거래”시 판매자에게 용역에 필요한 최소한의 이용자의 정보(성명,
            연락처)를 알려주는 경우
          </div>
        </div>
      </div>
      <h2 className="text-h2">제3장 서비스 이용</h2>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제10조 (서비스의 이용 게시)</h3>
        <div>
          회원은 본 약관의 확인 및 준수를 조건으로 서비스를 이용할 수 있습니다.
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제11조 (서비스의 이용시간)</h3>
        <div>
          1. 서비스는 회사의 업무상 또는 기술상 특별한 사유가 없는 한 연중무휴
          1일 24시간 제공함을 원칙으로 합니다. 회사는 서비스를 일정범위로
          분할하여 각 범위 별로 이용가능시간을 별도로 지정할 수 있습니다.
          <br />
          <br />
          2. 회사는 서비스의 제공에 필요한 경우 정기점검 내지 수시점검을 실시할
          수 있으며, 정기점검 내지 수시점검 시간은 서비스제공화면에 공지한 바에
          따릅니다.
          <br />
          <br />
          3. 고객센터 운영시간은 아래와 같이 규정합니다.
          <br />
          <br />
          <div className=" pl-3">
            a. 캐치룸 대표 고객센터 운영시간: 오전 9시부터 오후
            6시까지(점심시간 오전 12시부터 오후 1시 제외)
          </div>
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제12조 (서비스의 내용)</h3>
        <div>
          1. 서비스는 제2조 제1호에서 정의한 바에 따라 회사가 회원에게 제공하는
          여가 관련 온라인 플랫폼 서비스를 말합니다. 서비스는 현재 제공되는 상품
          등에 한정되지 않으며, 향후 추가로 개발되거나 다른 회사와의 제휴 등을
          통해 추가∙변경∙수정될 수 있고, 이 과정에서 일부 서비스의 경우 본인인증
          절차를 요구할 수 있습니다. <br />
          <br />
          2. 회사는 회원 감소 등으로 인한 원활한 서비스 제공의 곤란 및 수익성
          악화, 기술 진보에 따른 차세대 서비스로의 전환 필요성, 서비스 제공과
          관련한 회사 정책의 변경 등 기타 상당한 이유가 있는 경우에 운영상,
          기술상의 필요에 따라 제공하고 있는 전부 또는 일부 서비스를 변경 또는
          중단할 수 있습니다. <br />
          <br />
          3. 서비스의 내용, 이용방법, 이용시간에 대하여 변경 또는 서비스 중단이
          있는 경우에는 변경 또는 중단될 서비스의 내용 및 사유와 일자 등은 그
          변경 또는 중단 전에 회사 홈페이지 또는 서비스 내 “공지사항” 화면 등
          회원이 충분히 인지할 수 있는 방법으로 30일의 기간을 두고 사전에
          공지합니다. <br />
          <br />
          4. 무료로 제공되는 서비스의 특성상 본 조에 따른 서비스의 전부 또는
          일부 종료 시 관련 법령에서 특별히 정하지 않는 한 회원에게 별도의
          보상을 하지 않습니다. <br />
          <br />
          5. 서비스 이용에 관한 개별 안내, 상품 등에 대한 정보, 예약 시
          유의사항, 취소∙환불정책 등은 개별 서비스 이용안내∙소개 등을 통해
          제공하고 있습니다. <br />
          <br />
          6. 회원은 전항의 안내∙소개 등을 충분히 숙지하고 서비스를 이용하여야
          합니다. 회사는 통신판매중개자로서 통신판매의 당사자가 아니고, 판매자가
          상품 등 이용에 관한 이용정책이나 예약에 관한 취소∙환불정책을 별도로
          운영하는 경우가 있을 수 있으므로, 회원은 상품 등 이용 또는 예약 시
          반드시 그 내용을 확인해야 합니다. 회원이 이 내용을 제대로 숙지하지
          못해 발생한 피해에 대해서는 회사가 책임을 부담하지 않습니다.
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제13조 (게시물에 대한 권리)</h3>
        <div>
          1. 게시물의 저작권은 회원에게 있습니다. 다만 회사는 게시∙전달∙공유
          목적으로 회원이 작성한 게시물을 이용∙편집∙수정하여 이용할 수 있고,
          회사의 다른 서비스 또는 연동채널∙판매채널에 이를 게재하거나 활용할 수
          있습니다.
          <br />
          <br />
          2. 회사가 서비스 내 게재 이외의 목적으로 게시물을 사용할 경우 게시물에
          대한 게시자를 반드시 명시해야 합니다. 단, 게시자를 알 수 없는 익명
          게시물이나 비영리적인 경우에는 그러하지 아니합니다.
          <br />
          <br />
          3. 회원은 게시물을 작성할 때 타인의 저작권 등 지식재산권을 포함하여
          여타 권리를 침해하지 않아야 하고, 회사는 그에 대한 어떠한 책임도
          부담하지 않습니다. 만일 회원이 타인의 권리 등을 침해하였음을 이유로
          타인이 회사를 상대로 이의신청, 손해배상청구, 삭제요청 등을 제기한 경우
          회사는 그에 필요한 조치를 취할 수 있으며, 그에 따른 모든 비용이나
          손해배상책임은 회원이 부담합니다.
          <br />
          <br />
          4. 회사는 회원이 이용계약을 해지하고 사이트를 탈퇴하거나 적법한 사유로
          해지된 경우 해당 회원이 게시하였던 게시물을 삭제할 수 없으므로, 회원은
          작성한 게시물의 삭제를 원할 경우에는 회원 탈퇴 이전에 게시물을 모두
          삭제해야 합니다.
          <br />
          <br />
          5. 회원이 작성한 게시물에 대한 모든 권리 및 책임은 이를 게시한
          회원에게 있으며, 회사는 회원이 게시하거나 등록한 게시물이 다음 각 호에
          해당한다고 판단되는 경우에 사전통지 없이 삭제 또는 임시조치 할 수
          있고, 이에 대하여 회사는 어떠한 책임도 지지 않습니다.
          <br />
          <br />
          <div className=" pl-3">
            a. 다른 회원 또는 제3자를 비방하거나 명예를 손상시키는 내용인 경우
            <br />
            <br />
            b. 공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크시키는 경우
            <br />
            <br />
            c. 불법복제 또는 해킹을 조장하는 내용인 경우 <br />
            <br />
            d. 회사로부터 사전 승인 받지 않고 상업광고, 판촉 내용을 게시하는
            경우
            <br />
            <br />
            e. 개인 간 금전거래를 요하는 경우 <br />
            <br />
            f. 범죄적 행위에 결부된다고 인정되는 경우 <br />
            <br />
            g. 회사의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우
            <br />
            <br />
            h. 타인의 계정정보, 성명 등을 무단으로 도용하여 작성한 내용이거나,
            타인이 입력한 정보를 무단으로 위변조한 내용인 경우 <br />
            <br />
            i. 사적인 정치적 판단이나 종교적 견해의 내용으로 회사가 서비스
            성격에 부합하지 않는다고 판단하는 경우 <br />
            <br />
            j. 동일한 내용을 중복하여 다수 게시하는 등 게시의 목적에 어긋나는
            경우 <br />
            <br />
            k. 회사에서 규정한 게시물 원칙에 어긋나거나, 게시물을 작성하는
            위치에 부여된 성격에 부합하지 않는 경우 <br />
            <br />
            l. 사업주 변경 또는 인테리어 공사 등에 따른 권리자(사업주)의 게시물
            중단 또는 삭제 요청에 합리적인 사유가 있을 경우 <br />
            <br />
            m. 기타 관계법령에 위배된다고 판단되는 경우 <br />
            <br />
          </div>
          6. 회원의 게시물이 정보통신망법 및 저작권법 등 관련법에 위반되는
          내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당 게시물의
          게시중단 및 삭제 등을 요청할 수 있으며, 회사는 관련법에 따라 조치를
          취하여야 합니다. <br />
          <br />
          7. 회사는 본 조 제3항에 따른 권리자의 요청이 없는 경우라도 권리침해가
          인정될 만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는 경우에는
          관련법에 따라 해당 “게시물”에 대해 임시조치 등을 취할 수 있습니다.
          <br />
          <br />
          8. 본 조에 따른 세부절차는 정보통신망법 및 저작권법이 규정한 범위
          내에서 회사가 정한 게시중단요청서비스에 따릅니다.
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제14조 (권리의 귀속)</h3>
        <div>
          1. 서비스에 대한 저작권 및 지식재산권은 회사에 귀속됩니다. 단, 게시물
          및 제휴계약에 따라 제공된 저작물 등은 제외합니다. <br />
          <br />
          2. 회사가 제공하는 서비스의 디자인, 회사가 만든 텍스트,
          스크립트(scridivt), 그래픽, 회원 상호간 전송 기능 등 회사가 제공하는
          서비스에 관련된 모든 상표, 서비스 마크, 로고 등에 관한 저작권 기타
          지적재산권은 대한민국 및 외국의 법령에 기하여 회사가 보유하고 있거나
          회사에게 소유권 또는 사용권이 있습니다. <br />
          <br />
          3. 회원은 본 이용약관으로 인하여 서비스를 소유하거나 서비스에 관한
          저작권을 보유하게 되는 것이 아니라, 회사로부터 서비스의 이용을
          허락받게 되는 바, 서비스는 정보취득 또는 개인용도로만 제공되는 형태로
          회원이 이용할 수 있습니다. <br />
          <br />
          4. 회원은 명시적으로 허락된 내용을 제외하고는 서비스를 통해 얻어지는
          회원 상태정보를 영리 목적으로 사용, 복사, 유통하는 것을 포함하여
          회사가 만든 텍스트, 스크립트, 그래픽의 회원 상호간 전송기능 등을
          복사하거나 유통할 수 없습니다. <br />
          <br />
          5. 회사는 서비스와 관련하여 회원에게 회사가 정한 이용조건에 따라 계정,
          ID, 콘텐츠 등을 이용할 수 있는 이용권만을 부여하며, 회원은 이를 양도,
          판매, 담보제공 등의 처분행위를 할 수 없습니다. <br />
          <br />
          6. 회원은 서비스를 이용하는 과정에서 얻은 정보를 회사의 사전 승낙 없이
          복제, 송신, 출판, 배포, 방송, 편집, 재가공 등 기타 방법에 의하여 영리
          목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제15조 (거래 기록의 보관)</h3>
        <div>
          거래기록은 전자상거래등에서의 소비자보호에 관한 법률에 규정에 의해
          일정기간 동안 보존 할 수 있습니다.
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제16조 (거래 시 가능한 결제 수단)</h3>
        <div>
          회사에서 구매한 재화 또는 용역에 대한 대금지급방법은 다음 각 호의
          하나로 할 수 있습니다. <br />
          <br />
          1. 신용카드 결제 <br />
          <br />
          2. 간편결제 <br />
          <br />
          3. 기타 회사가 추가 지정하는 결제수단
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">
          제17조 (거래 구매결정 및 송금, 대금의 정산 및 수수료 등)
        </h3>
        <div>
          1. 거래는 판매 및 구매 등 거래 신청에 대한 승낙의 표시가 “이용자”
          상호간 “캐치룸”의 제반 “서비스”를 통해 이루어지며 결제대금은 “이용자”
          상호간의 합의를 통한 구매 결정이 이루어질 경우 “판매자”에게 예치금의
          형태로 지급합니다. <br />
          <br />
          2. 거래시 “회사”는 거래 대금에 대하여 안정적으로 보관하며, “이용자”
          상호간의 분쟁 발생 시 “회사”는 문제가 해결되기 전까지 “이용자”에게
          지급 또는 환불을 하지 않습니다. <br />
          <br />
          3. “이용자”의 고의 또는 과실로 인하여 발생하는 손해에 대해 회사는
          책임을 지지 않습니다. <br />
          <br />
          4. 예치금은 등록한 본인 명의의 계좌로 출금할 수 있습니다. <br />
          <br />
          5. 수수료 등은 판매자나 구매자 일방 혹은 쌍방에게 부과될 수 있습니다.
          판매자 부담분의 경우 판매자가 정산 받을 상품 대금에서 공제되고, 구매자
          부담분의 경우 결제 단계에서 상품 대금과 함께 결제됩니다. <br />
          <br />
          6. 거래 수수료 등에 대하여 판매자는 매물 등록 등 이용에 동의하는
          단계에서, 구매자는 상품 대금 결제 단계에서 고지 받으실 수 있습니다.
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제18조 (거래 시 취소 및 환불)</h3>
        <div>
          1. 상품의 특성상 “거래”시 취소와 환불은 불가합니다. <br />
          <br />
          2. “거래”시 상품의 성격에 따라 회사는 별도의 취소 및 환불 관련 규정을
          정할 수 있으며, 이 경우 별도 계약 및 이용조건상의 취소 및 환불 규정이
          우선 적용됩니다. <br />
          <br />
          3. 기타 취소 및 환불규정은 전자상거래 등의 소비자보호에 관한 법률 등
          관련 법령을 준수합니다.
        </div>
      </div>
      <h2 className="text-h2">제4장 회사 및 회원의 의무</h2>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제19조 (회사의 의무)</h3>
        <div>
          1. 회사는 관련법과 본 약관이 금지하거나 미풍양속에 반하는 행위를 하지
          않으며, 계속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여
          노력합니다. <br />
          <br />
          2. 회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보보호를
          위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수하며,
          회원의 개인정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않고, 이를
          보호하기 위하여 노력합니다. <br />
          <br />
          3. 회사는 서비스이용과 관련하여 회원으로부터 제기된 의견이나 불만이
          정당하다고 인정할 경우에는 그에 필요한 조치를 취하여야 합니다. <br />
          <br />
          4. 회사가 제공하는 서비스로 인하여 회원에게 손해가 발생한 경우 그러한
          손해가 회사의 고의나 과실에 의해 발생한 경우에 한하여 회사에서 책임을
          부담합니다.
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제20조 (회원, 이용자의 의무)</h3>
        <div>
          1. 회원은 기타 관계 법령, 본 약관의 규정, 이용안내 및 서비스상에
          공지한 주의사항, 회사가 통지하는 사항 등을 준수하여야 하며, 기타
          회사의 업무에 방해되는 행위를 하여서는 아니 됩니다. <br />
          <br />
          2. 회원은 서비스의 이용권한, 기타 서비스 이용계약상의 지위를 타인에게
          양도, 증여할 수 없으며 이를 담보로 제공할 수 없습니다. <br />
          <br />
          3. 회원은 서비스 이용과 관련하여 다음 각 호의 행위를 하여서는
          안됩니다. <br />
          <br />
          <div className=" pl-3">
            a. 서비스 신청 변경, 본인인증 등 서비스 이용과정에서 허위내용을
            기재∙등록∙전송 등을 하는 행위 <br />
            <br />
            b. 다른 회원의 아이디 및 비밀번호를 도용하여 부당하게 서비스를
            이용하거나, 정보를 도용하는 행위 <br />
            <br />
            c. 타인의 계좌번호 및 신용카드번호 등 타인의 허락 없이 타인의
            결제정보를 이용하여 회사의 유료서비스를 이용하는 행위 <br />
            <br />
            d. 정당한 사유 없이 당사의 영업을 방해하는 내용을 기재하는 행위{' '}
            <br />
            <br />
            e. 회사가 게시한 정보를 변경하는 행위 <br />
            <br />
            f. 회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등을 송신 또는
            게시하는 행위 <br />
            <br />
            g. 회사와 기타 제3자의 저작권 등 지적재산권을 침해하는 행위 <br />
            <br />
            h. 회사 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위{' '}
            <br />
            <br />
            i. 외설 또는 폭력적인 메시지, 화상, 음성 기타 공공질서 미풍양속에
            반하는 정보를 공개 또는 게시하는 행위 <br />
            <br />
            j. 회사의 동의 없이 영리를 목적으로 서비스를 사용하는 행위 <br />
            <br />
            k. 회사의 직원이나 서비스의 관리자를 가장하거나 사칭하여 또는 타인의
            명의를 도용하여 글을 게시하거나 메일을 발송하는 행위 <br />
            <br />
            l. 회사의 웹 · 앱과 서버 간의 전송 내용 등을 확인하거나 소스 코드
            등의 추출을 시도하기 위해 패킷 캡처 및 이와 유사 · 동일한 기능의
            프로그램 등을 사용하여 회사의 웹 · 앱 · 서버에 접근하거나 해당
            프로그램 등을 통하여 알게 된 소스 코드(URL 포함) 및 명령 구문 등을
            사용하여 회사의 웹 · 앱 ·서버에 접근하는 행위 <br />
            <br />
            m. 회사의 명시적인 사전 서면 허가 없이 데이터 등을 추출하기 위하여
            로봇(봇), 크롤러, 스파이더, 스크레이퍼, 매크로 프로그램 또는 기타
            자동화 수단이나 수동 프로세스를 이용하여 회사의 웹 · 앱 · 서버에
            접근하거나 회사 서비스에 포함된 콘텐츠 및 정보를 모니터링 복제,
            수집, 확인, 정리, 사용하는 등의 행위 <br />
            <br />
            n. 서비스와 관련된 설비의 오동작이나 정보 등의 파괴 및 혼란을
            유발시키는 컴퓨터 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램
            자료를 등록 또는 유포하는 행위 <br />
            <br />
            o. 회사가 제공하는 소프트웨어 등을 개작하거나 해독, 리버스
            엔지니어링, 디컴파일, 디스어셈블 및 기타 일체의 가공행위를 통하여
            서비스를 복제, 분해 또는 모방 기타 변형하는 행위 및 이를 목적으로
            또는 이를 통하여 알게 된 소스코드(URL 포함) 및 명령 구문 등을
            사용하여 회사의 웹 · 앱 · 서버에 접근하는 행위 <br />
            <br />
            p. 자동 접속 프로그램 등을 사용하는 등 정상적인 용법과 다른 방법으로
            서비스를 이용하여 회사의 서버에 부하를 일으켜 회사의 정상적인
            서비스를 방해하는 행위 <br />
            <br />
            q. 회사의 웹 · 앱 · 서버에서 로봇 배제 헤더의 제한 사항을 위반하거나
            회사의 웹 · 앱 · 서버 및 서비스에 대한 접근을 방지 또는 제한하기
            위해 채택되는 기타 조치를 우회 또는 회피하는 일체의 행위(예: IP를
            지속적으로 바꿔가며 접속하는 행위, Captcha를 외부 솔루션 등을 통해
            우회하거나 무력화하는 행위 등) 및 이를 통하여 회사의 웹 · 앱 ·
            서버에 접근하는 행위 <br />
            <br />
            r. 회사의 사전 서면 승인 없이 회사의 웹, 앱, 서비스, 콘텐츠, 회사의
            브랜딩 또는 페이지 레이아웃이나 디자인 등을 사용, 복제, 전시,
            미러링, 프레이밍, 딥링크 하는 행위 <br />
            <br />
            s. 해킹, 비밀번호 마이닝 또는 기타 수단을 통해 회사의 웹 · 앱 ·
            서버, 기타 관련 웹사이트, 다른 계정, 컴퓨터 시스템 및 네트워크 등에
            대한 승인되지 않은 접속 권한을 얻기 위해 시도하는 행위 및 이를
            통하여 회사의 웹 · 앱 · 서버 등에 접근하는 행위 <br />
            <br />
            t. 회사가 제공하는 서비스 및 콘텐츠 · 정보를 상업적이거나 경쟁적인
            목적, 회사의 사업 현황을 파악하기 위한 목적, 불법적이거나 비합법적인
            목적, 또는 본 이용 약관에서 금지하는 목적 등으로 사용하기 위하여
            회사의 웹 · 앱 · 서버에 접근하는 일체의 행위 <br />
            <br />
            u. 다른 회원의 개인정보를 그 동의 없이 수집, 저장, 공개하는 행위{' '}
            <br />
            <br />
            v. 기타 불법적이거나 회사에서 정한 규정을 위반하는 행위 <br />
            <br />
          </div>
          4. 회사는 회원이 제1항의 행위를 하는 경우 해당 게시물 등을 삭제 또는
          임시 삭제할 수 있으며 그러한 사유가 있음을 회원에게 개별 통지함으로써
          서비스의 이용을 제한하거나 본 계약을 해지할 수 있습니다. 단,
          법률적으로 통지가 허용되지 아니하는 경우(예컨대, 통지하는 행위가 법령
          또는 규제당국의 명령에 위배되거나 규제당국의 조사를 방해하는 결과를
          초래하는 경우)나, 통지로 인하여 회원, 제3자, 회사 및 그 계열회사에
          손해가 발생할 수 있다고 합리적으로 판단되는 경우(서비스의 보안을
          해하는 경우 등)를 제외하고, 회원에게 게시물 삭제 사유를 제21조에 따라
          통지합니다. <br />
          <br />
          5. 회원은 회원정보, 계정정보에 변경이 있는 경우 제7조에 따라 이를 즉시
          변경하여야 하며, 더불어 비밀번호를 철저히 관리하여야 합니다. 회원의
          귀책으로 말미암은 관리소홀, 부정사용 등에 의하여 발생하는 모든 결과에
          대한 책임은 회원 본인이 부담하며, 회사는 이에 대한 어떠한 책임도
          부담하지 않습니다. <br />
          <br />
          6. 민법상 미성년자인 회원이 유료 서비스를 이용할 경우 미성년자인
          회원은 결제 전 법정대리인의 동의를 얻어야 하며, 만 14세 미만 아동의
          경우 본 서비스를 이용할 수 없습니다. <br />
          <br />
          7. 회원은 회사에서 공식적으로 인정한 경우를 제외하고는 서비스를
          이용하여 상품을 판매하는 영업 활동을 할 수 없으며, 특히 해킹, 광고를
          통한 수익, 음란사이트를 통한 상업행위, 상용소프트웨어 불법배포 등을 할
          수 없습니다. 이를 위반하여 발생한 영업 활동의 결과 및 손실, 관계기관에
          의한 구속 등 법적 조치 등에 관해서는 회사가 책임을 지지 않으며, 회원은
          이와 같은 행위와 관련하여 회사에 대하여 손해배상 의무를 집니다. <br />
          <br />
          8. 회원은 직접 본인의 정보로 본인인증을 하여야 하고 이를 타인으로
          하여금 하게 하거나 인증번호 등의 정보를 노출하여서는 안됩니다.
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제21조 (회원에 대한 통지)</h3>
        <div>
          1. 회사가 회원에 대한 통지를 하는 경우 본 약관에 별도 규정이 없는 한
          회원이 기재한 E-mail로 할 수 있습니다. <br />
          <br />
          2. 회사는 불특정 다수 회원에 대한 통지의 경우 서비스 게시판 등에
          게시함으로써 개별 통지에 갈음할 수 있습니다. 다만, 회원의 서비스
          이용과 관련하여 중대한 영향을 미치는 사항에 대하여는 개별통지를
          합니다.
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제22조 (서비스 이용 해지)</h3>
        <div>
          1. 회원이 이용계약을 해지하고자 하는 때에는 야놀자 사이트 또는 앱을
          통해 안내된 해지방법에 따라 해지를 신청할 수 있습니다.
          <br />
          <br />
          2. 회사는 등록 해지신청이 접수되면 회원이 원하는 시점에 해당 회원의
          서비스 이용을 해지하여야 합니다.
          <br />
          <br />
          3. 회원이 계약을 해지할 경우, 관련법 및 개인정보처리방침에 따라 회사가
          회원정보를 보유할 수 있는 경우를 제외하고 회원의 개인정보는 해지 즉시
          삭제됩니다.
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제23조 (서비스 이용 제한)</h3>
        <div>
          1. 회사는 이용제한정책에서 정하는 바에 따라 회원이 본 약관상 의무를
          위반하거나 서비스의 정상적인 운영을 방해한 경우, 경고∙일시적
          이용정지∙영구적 이용정지 등의 단계로 서비스 이용을 제한하거나
          이용계약을 해지할 수 있습니다. 단, 회원에게 제6조 제1항 및 제20조
          제3항의 사유가 있음이 확인되거나 회원이 서비스 이용과 관련하여
          불법행위를 하거나 조장∙방조한 경우에는 즉시 영구적 이용정지 조치 또는
          이용계약 해지를 할 수 있습니다. <br />
          <br />
          2. 회사는 회원이 계속해서 1년(이용자의 선택에 따라 3년 또는 5년)- 이상
          서비스를 이용하지 않은 경우에는, 정보통신망법에 따라 필요한 조치를
          취할 수 있고, 회원정보의 보호 및 운영의 효율성을 위해 이용을 제한할 수
          있습니다. <br />
          <br />
          3. 본 조에 따라 회원의 서비스 이용을 제한하거나 계약을 해지하는
          경우에는 회사는 법률적으로 통지가 허용되지 아니하는 경우(예컨대,
          통지하는 행위가 법령 또는 규제당국의 명령에 위배되거나 규제당국의
          조사를 방해하는 결과를 초래하는 경우)나, 통지로 인하여 회원, 제3자,
          회사 및 그 계열회사에 손해가 발생할 수 있다고 합리적으로 판단되는
          경우(서비스의 보안을 해하는 경우 등)를 제외하고, 회원에게 이용 제한
          사유를 제21조에 따라 회원에게 통지합니다. <br />
          <br />
          4. 회원은 본 조에 따른 서비스 이용정지 기타 서비스 이용과 관련된
          이용제한에 대해 회사가 정한 절차에 따라 이의신청을 할 수 있으며,
          회사는 회원의 이의신청이 정당하다고 판단되는 경우 즉시 서비스 이용을
          재개합니다.
        </div>
      </div>
      <h2 className="text-h2">제5장 기타</h2>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제24조 (손해 배상)</h3>
        <div>
          1. 회원이 본 약관의 규정을 위반함으로 인하여 회사에 손해가 발생하게
          되는 경우, 본 약관을 위반한 회원은 회사에 발생하는 손해를 배상하여야
          합니다. <br />
          <br />
          2. 회원이 서비스를 이용하는 과정에서 행한 불법행위나 본 약관
          위반행위로 인하여 회사가 당해 회원 이외의 제3자로부터 손해배상 청구
          또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 회원은 자신의 책임과
          비용으로 회사를 면책시켜야 하며, 회사가 면책되지 못한 경우 당해 회원은
          그로 인하여 회사에 발생한 손해를 배상하여야 합니다. 다만, 회사의 고의
          또는 중과실로 발생한 손해에 대해서는 회사는 민법 등 관계 법령에 따라
          책임을 부담합니다.
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제25조 (면책사항)</h3>
        <div>
          1. 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를
          제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면책됩니다. <br />
          <br />
          2. 회사는 회원의 귀책사유로 인한 서비스의 이용장애에 대하여 책임을
          지지 않습니다. <br />
          <br />
          3. 회사는 회원이 서비스를 이용하여 기대하는 수익을 상실한 것에 대하여
          책임을 지지 않으며 그 밖에 서비스를 통하여 얻은 자료로 인한 손해 등에
          대하여도 책임을 지지 않습니다. 회사는 회원이 게재한 게시물(이용후기,
          숙소평가 등 포함)의 정확성 등 내용에 대하여는 책임을 지지 않습니다.{' '}
          <br />
          <br />
          4. 회사는 회원 상호간 또는 회원과 제3자 상호간에 서비스를 매개로
          발생한 분쟁에 대해서는 개입할 의무가 없으며 이로 인한 손해를 배상할
          책임도 없습니다. <br />
          <br />
          5. 상품 등은 판매자의 책임 하에 관리∙운영되고, 회사는
          통신판매중개자로서 서비스 운영 상의 문제를 제외한 상품 등의 하자∙부실
          등으로 인한 책임은 판매자에게 귀속되며 회사는 어떠한 책임도 부담하지
          않습니다. <br />
          <br />
          6. 회사는 제3자가 서비스 내 화면 또는 링크된 웹사이트를 통하여 광고한
          제품 또는 서비스의 내용과 품질에 대하여 감시할 의무가 없으며 그로 인한
          어떠한 책임도 지지 아니합니다. <br />
          <br />
          7. 회사는 회사 및 회사의 임직원 그리고 회사 대리인의 고의 또는 중대한
          과실이 없는 한 다음 각 호의 사항으로부터 발생하는 손해에 대해 책임을
          지지 아니합니다. <br />
          <br />
          <div className=" pl-3">
            a. 회원정보 등의 허위 또는 부정확성에 기인하는 손해 <br />
            <br />
            b. 서비스에 대한 접속 및 서비스의 이용과정에서 발생하는 개인적인
            손해
            <br />
            <br />
            c. 서버에 대한 제3자의 모든 불법적인 접속 또는 서버의 불법적인
            이용으로부터 발생하는 손해 <br />
            <br />
            d. 서버에 대한 전송 또는 서버로부터의 전송에 대한 제3자의 모든
            불법적인 방해 또는 중단행위로부터 발생하는 손해 <br />
            <br />
            e. 제3자가 서비스를 이용하여 불법적으로 전송, 유포하거나 또는 전송,
            유포되도록 한 모든 바이러스, 스파이웨어 및 기타 악성 프로그램으로
            인한 손해 <br />
            <br />
            f. 전송된 데이터의 오류 및 생략, 누락, 파괴 등으로 발생되는 손해{' '}
            <br />
            <br />
            g. 회원간의 회원 상태정보 등록 및 서비스 이용 과정에서 발생하는
            명예훼손 기타 불법행위로 인한 각종 민∙형사상 책임
          </div>
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제26조 (분쟁해결)</h3>
        <div>
          1. 회사는 이용자 상호 간 분쟁에서 발생하는 문제에 대해서 일체의 책임을
          지지 않습니다. 이용자 상호 간 분쟁은 당사자 간에 직접 해결해야 합니다.
          <br />
          <br />
          2. 이용자 상호 간에 발생한 전자상거래 분쟁과 관련하여 이용자의
          피해구제신청이 있는 경우에는 공정거래위원회 또는 시,도지사가 의뢰하는
          분쟁조정기관에 조정에 따를 수 있습니다.
        </div>
      </div>
      <div id="todiv" className="flex flex-col gap-3">
        <h3 className="text-h3">제27조 (준거법 및 관할법원)</h3>
        <div>
          1. 본 약관과 회사와 회원간에 발생한 분쟁 등에 관하여는 대한민국 법령이
          적용되며, 회사의 주소지를 관할하는 법원을 관할법원으로 합니다. <br />
          <br />
          2. 본 약관에 명시되지 않은 사항은 전자거래기본법, 전자서명법,
          전자상거래등에서의 소비자보호에 관한 법률 기타 관련 법령의 규정 및
          국내(외) 여행 표준약관 등에 의합니다.
        </div>
      </div>
    </div>
  );
};

export default divage;
