import React from 'react';

const page = () => {
  return (
    <div className="w-full p-5 flex flex-col  gap-5 h-[calc(100vh-100px)] overflow-x-scroll">
      <p>
        주식회사 캐치룸이하 ‘회사’은 고객의 개인정보보호를 위해 최선의 노력을
        다하고 있으며, 「개인정보보호법」 관련조항과 「정보통신망 이용촉진 및
        정보보호에 관한 법률」의 기준에 따라 ‘개인정보처리방침’을 수립하여 이를
        준수하고 있습니다. 회사는 개인정보 처리방침을 통해 고객이 제공한
        개인정보가 어떠한 용도와 방식으로 이용되며, 개인정보보호를 위해 어떠한
        조치가 취해지고 있는지 알려드립니다. 개인정보처리방침은 관련 법률 및
        지침의 변경, 회사 내부 정책의 변경 등으로 수시로 변경될 수 있으며,
        개정하는 경우 변경 사항에 대하여 서비스 화면에 게시하거나 고객에게
        고지하겠습니다. 1. 개인정보의 수집 및 이용 목적 회사는 여행상품의 예약
        및 관련 서비스 제공 등의 업무처리를 위하여 최소한의 필수정보를 수집하고
        있으며, 수집한 모든 개인정보는 별도의 동의가 없는 한 개인정보의 수집 및
        이용 목적에서 고지한 이외의 다른 목적으로 사용되지 않습니다. 회사는
        수집한 개인정보를 다음의 목적을 위해 활용합니다. 1 회원 서비스 제공 :
        회원 가입, 본인 인증, 개인 식별, 연령 제한 서비스의 제공, 본인 의사
        확인, 가입 여부 확인, 재가입 제한, 문의사항 및 분쟁 조정기록, 회원 탈퇴
        대해 ‘동의함’ 또는 ‘동의하지 않음’을 클릭할 수 있는 절차를 마련하여
        ‘동의함’을 클릭하면 개인정보 수집에 대해 동의한 것으로 봅니다. 단,
        회사는 다음{' '}
      </p>
    </div>
  );
};

export default page;
